#include<stdio.h>
#include<conio.h>
#include<windows.h>
#include<string.h>
#include<time.h>
#include<stdlib.h>
int score=0,Score=0;
int map_re(int [][],char );//0表示空地，1表示墙，2表示果实，3表示蛇
int Control(int *);
int map_pr(int [][]);
int move(int [][],int *);
int histroy(int [][],int ,int ,int );
int sweet(int [][]);

int main(void)
{
    char A,N;
    int * control,B=7;
    *control=B;
    int Map[12][64]=
    {
        {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
        {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,1,0,0,0,1,0,0,1,1,1,0,0,0,1,1,1,1,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,1,1,0,1,1,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,1,0,1,0,1,0,0,1,1,1,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,1,0,1,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,1,0,0,0,1,0,0,1,1,1,0,0,0,1,1,1,1,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
        {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,3,0,1},
        {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
    }; 
    printf("This is the Task-6:\nThe Console-Snake\nHave a good time.\n(Input twice to start.)\n\t\tBy:Yinlianlei\n\nPlese get something Enter:");
    N=getchar();
    map_pr(Map);
    sweet(Map);
    while(1)
    {
        if(Score==12)
        {
            printf("Congretulation!\nYou win!");
        }
        Control(control);
        sweet(Map);
        if(*control==0)
            break;
        else if(*control==9)
        {
            printf("\n\nThe snake is dead!\nYou lose!\n");
            break;
        }
        move(Map,control);
        Sleep(1000);
        system("cls");
        map_pr(Map);
        printf("Your score:%d (%d)(Just for judge)\n",Score,score);
    }
    printf("Your score is:%d\nThank you for playing!\n",Score);
    return 0;
}

int map_pr(int Map[12][64])
{
    int X,Y;
    for(X=0;X<12;X++)
    {
        for(Y=0;Y<64;Y++)
        {
            if(Map[X][Y]==1)
                printf("@");
            else if(Map[X][Y]==0)
                printf(" ");
            else if(Map[X][Y]==3)
                printf("O");
            else if(Map[X][Y]==2)
                printf("#");
        }
        printf("\n");
    }
    
}//打印地图

int Control(int * control)//4左，5右，7上，8下,6不变//get(√))
{
    int To;
    static int To2=0;
    if(_kbhit())
    {
        To=_getch();
        switch(To)
        {
            case 119:if(To2!=8)
            {
                To=To2=7;
            };break;
            case 115:if(To!=7)
            {
                To=To2=8;
            }break;
            case 97:if(To2!=5)
            {
                To=To2=4;
            }break;
            case 100:if(To2!=4)
            {
                To=To2=5;
            }break;
            case 113:To=0;break;
            default:
                To=6;break;
        }
        *control=To;
    }

}

int move(int Map[12][64],int *toward)//开始向上移动
{
    static int X=10,Y=61,Long=1,x=11,y=61;
    int tail[12][64];
    tail[x][y]=3;//必须保留，不然输出出现问题
    if(*toward==7 && *toward!=8)
    {
        X--;
        Map[X][Y]=3;
        histroy(Map,X,Y,Long);
    }
    else if(*toward==8  && *toward!=7)
    {
        X++;
        Map[X][Y]=3;
        histroy(Map,X,Y,Long);
    }
    else if(*toward==4 && *toward!=5)
    {
        Y--;
        Map[X][Y]=3;
        histroy(Map,X,Y,Long);
    }
    else if(*toward==5 && *toward!=4)
    {
        Y++;
        Map[X][Y]=3;
        histroy(Map,X,Y,Long);
    }   
    //吃掉果实，增加蛇尾
    if(Map[X-1][Y]==2 && Map[X][Y]==3 && *toward==7)
    {
        Long+=1;
        score=0;
        Score+=1;
        //printf("%d\n",score);
    }
    else if(Map[X+1][Y]==2 && Map[X][Y]==3 && *toward==8)
    {
        Long+=1;
        score=0;
        Score+=1;
        //printf("%d\n",score);
    }
    else if(Map[X][Y-1]==2 && Map[X][Y]==3 && *toward==4)
    {
        Long+=1;
        score=0;
        Score+=1;
        //printf("%d\n",score);
    }
    else if(Map[X][Y+1]==2 && Map[X][Y]==3 && *toward==5)
    {
        Long+=1;
        score=0;
        Score+=1;
        //printf("%d\n",score);
    }
    
    //判断输赢
    int To;
    if((Map[X-1][Y]==1 || Map[X-1][Y]==3) && Map[X][Y]==3 && *toward==7)
    {
        To=9;
        *toward=To;
    }
    else if((Map[X+1][Y]==1 || Map[X+1][Y]==3) && Map[X][Y]==3 && *toward==8)
    {
        To=9;
        *toward=To;
    }
    else if((Map[X][Y-1]==1 || Map[X][Y-1]==3) && Map[X][Y]==3 && *toward==4)
    {
        To=9;
        *toward=To;
    }
    else if((Map[X][Y+1]==1 || Map[X][Y+1]==3) && Map[X][Y]==3 && *toward==5)
    {
        To=9;
        *toward=To;
    }
}

int histroy(int Map[12][64],int X,int Y,int Long)//蛇尾问题解决
{
    static int histroy[10][62]=
    {
        {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0},
    };
    
    int x,y;
    static int move=2,c=0;
    for(x=1;x<11;x++)
    {
        for(y=1;y<63;y++)
        {
            if(Map[x][y]==3 && histroy[x][y]==0)
            {
                histroy[x][y]=move;
                printf("move:%d X:%d Y:%d\n",histroy[x][y],x,y);
                //printf("%d %d %d\n",histroy[x][y-1],x,y);
                move+=1;
            }
        }
    }
    for(x=1;x<11;x++)
    {
        for(y=20;y<63;y++)
        {
            if(histroy[x][y]<move-Long && Map[x][y]!=1 && Map[x][y]!=2)
            {
                    Map[x][y]=0;
                    histroy[x][y]=0;
            }
        }
        //printf("\n");
    }
}

int sweet(int Map[12][64])
{
    int sweet_x,sweet_y,x,y,s=0;
    static int A=10;
    for(x=0;x<12;x++)
    {
        for(y=0;y<64;y++)
        {
            if(Map[x][y]!=2)
            s++;
        }
    }

    if(score==0 || s==768)
    {
        srand((unsigned int)time(NULL)*A);
        A+=10;
        sweet_x=rand()%10;
        sweet_y=rand()%41;
        Map[sweet_x+1][sweet_y+20]=2;
        printf("sweet.x:%d sweet.y:%d\n",sweet_x,sweet_y);
        score=1;
    }
}
